# Пользователь вводит 6 чисел. Вывести минимальное и максимальное из введенных чисел. Не использовать встроенные в питон функции min и max.
#
# Пример входных данных 1:
# 1, 2, 3, 4, 5, 6
# Пример выходных данных 1:
# 1, 6
#
# Пример входных данных 2:
# 6, 5, 4, 3, 2, 1
# Пример выходных данных 2:
# 1, 6
#
# Пример входных данных 3:
# 1, 5, 3, 1, 26, 0
# Пример выходных данных 3:
# 0, 26
#
# Пример входных данных 4:
# 23, 1, 24, 1, 2
# Пример выходных данных 4:
# 1, 24
#
# Пример входных данных 5:
# 1, 4, 7, 1, 7, 3
# Пример выходных данных 5:
# 1, 7

def sortir4(a5, a6):
    if a5 < a6:
        a5, a6 = a6, a5
    return a5, a6

def sortir3(a4, a5, a6):
    if a4 < a5:
        a4, a5 = a5, a4
    a5, a6 = sortir4(a5, a6)
    return a4, a5, a6

def sortir2(a3, a4, a5, a6):
    if a3 < a4:
        a3, a4 = a4, a3
    a4, a5, a6 = sortir3(a4, a5, a6)
    return a3, a4, a5, a6

def sortir1(a2, a3, a4, a5, a6):
    if a2 < a3:
        a2, a3 = a3, a2
    a3, a4, a5, a6 = sortir2(a3, a4, a5, a6)
    return a2, a3, a4, a5, a6

def sortir0(a1, a2, a3, a4, a5, a6):
    if a1 < a2:
        a1, a2 = a2, a1
    a2, a3, a4, a5, a6 = sortir1(a2, a3, a4, a5, a6)
    return a1, a2, a3, a4, a5, a6


def solve():
    a1 = int(input('Введите первое    число: '))
    a2 = int(input('Введите второе    число: '))
    a3 = int(input('Введите третье    число: '))
    a4 = int(input('Введите четвертое число: '))
    a5 = int(input('Введите пятое     число: '))
    a6 = int(input('Введите шестое    число: '))
    a1, a2, a3, a4, a5, a6 = sortir0(a1, a2, a3, a4, a5, a6)
    a1, a2, a3, a4, a5, a6 = sortir0(a1, a2, a3, a4, a5, a6)
    a1, a2, a3, a4, a5, a6 = sortir0(a1, a2, a3, a4, a5, a6)
    a1, a2, a3, a4, a5, a6 = sortir0(a1, a2, a3, a4, a5, a6)
    a1, a2, a3, a4, a5, a6 = sortir0(a1, a2, a3, a4, a5, a6)
    print()
    print('Да, детка, это сортировка без цикла и массива!')
    print('______________________________________________')
    print('По убыванию:')
    print(a1, a2, a3, a4, a5, a6)
    print('По возрастанию:')
    print(a6, a5, a4, a3, a2, a1)
    print('______________________________________________')

if __name__ == '__main__':
    solve()